Repository: codelight-eu/woocommerce-lhv-hire-purchase
Catalog: i18n/lhv-hire-purchase-*.po
Languages: et

source: LHV hire-purchase
et: LHV järelmaks

source: Payment with LHV hire-purchase takes only a few minutes. Quick response to your application, affordable interest, down-payment from 0 euros. Premature payment free of charge.
et: LHV järelmaksuga maksmine võtab vaid mõned minutid. Kiire vastus taotlusele, soodne intress, sissemakse alates 0€. Kui soovid, tagasta kogu summa tasuta enne tähtaega.

source: To enable LHV hire-purchase payment gateway, please go to %ssettings%s and fill in the following fields:
et: LHV järelmaksumooduli sisse lülitamiseks mine palun %sseadete lehele%s ja täida ära järgnevad väljad:

source: Pending LHV confirmation
et: LHV kinnituse ootel

source: Settings
et: Seaded

source: Documentation
et: Dokumentatsioon

source: Support
et: Klienditugi

source: Shipping
et: Tarne

source: You should receive an email from AS LHV Finance soon!
et: Aitäh! AS LHV Finance saadab teile peagi e-kirja.

source: Sorry, it appears that AS LHV Finance refused the contract. Please choose another payment method or contact support.
et: Kahjuks keeldus AS LHV Finance järelmaksulepingust. Tellimuse sooritamiseks vali mõni teine maksemeetod või võta ühendust klienditoega.

source: We were unable to process the order using LHV hire-purchase due to a technical error. Please contact the store support or use a different payment method.
et: Tehnilise vea tõttu tellimus ebaõnnestus. Palun võta ühendust poe klienditoega või kasuta mõnda teist maksemeetodit.

source: Enable LHV hire-purchase
et: Lülita LHV järelmaksumoodul sisse

source: Enable LHV hire-purchase payment gateway
et: Lülita LHV järelmaksumoodul sisse

source: LHV hire-purchase test mode
et: LHV järelmaksumooduli testrežiim

source: Enable LHV hire-purchase test mode
et: Lülita LHV järelmaksumooduli testrežiim sisse

source: If this is checked, LHV hire-purchase will run in test mode. Real payments will not be made.
et: LHV testrežiim võimaldab sooritada test-oste, mis ei lähe LHV poolel kirja päris tellimustena.

source: Website test mode
et: Veebilehe testrežiim

source: Enable website test mode
et: Lülita veebilehe testrežiim sisse

source: If this is checked, LHV hire-purchase will only be visible to users with Administrator role. Use this if you want to test the gateway in production without customers being able to see it.
et: Veebilehe testrežiim teeb LHV järelmaksuga tasumise nähtavaks ainult sisse logitud "Administraator" rolliga kasutajatele. Sellega on võimalik järelmaksu testida live-saidil ilma tavakasutajaid häirimata.

source: Title
et: Pealkiri

source: This controls the payment gateway title which the user sees during checkout.
et: Maksemeetodi pealkiri, mida klient kassas näeb.

source: Description
et: Kirjeldus

source: This controls the payment gateway description which the user sees during checkout.
et: Maksemeetodi kirjeldus, mida klient kassas näeb.

source: Merchant ID (VK_SND_ID)
et: Kaupmehe ID (VK_SND_ID)

source: Your merchant ID should be provided by AS LHV Finance customer support. If you do not know your merchant ID, please contact LHV by email: %s or by phone: %s.
et: Sinu kaupmehe ID anti sulle lepingu allkirjastamise käigus AS LHV Finance klienditoe poolt. Kui sa oma kaupmehe ID-d ei tea, siis võta ühendust klienditoega e-maili teel: %s või telefoni teel: %s.

source: Your private key
et: Sinu privaatvõti

source: To sign the contract with AS LHV Finance, you generated a keypair with a public and private key. You sent the public key to AS LHV Finance. Enter the matching private key here.
et: AS LHV Finance-ga lepingu allkirjastamiseks oli vaja genereerida võtmepaar avaliku- ja privaatvõtmega. Avalik võti tuli saata AS LHV Finance-le. Sisesta siia sellele avalikule võtmele vastav privaatvõti.

source: Your private key password
et: Privaatvõtme parool

source: If you private key was password-protected, enter the password here. If you are not sure, just leave this blank.
et: Kui su privaatvõti on parooliga kaitstud, sisesta parool siia. Kui sa pole kindel, siis jäta see väli lihtsalt tühjaks.

source: LHV public key
et: LHV avalik võti

source: AS LHV Finance public key. You probably do not need to change this.
et: AS LHV Finance avalik võti. Tõenäoliselt ei ole vaja seda muuta.

source: You are running the development version of LHV hire-purchase which requires you to run 'composer install'
et: LHV järelmaksumooduli arendusversioon vajab käsu 'composer install' jooksutamist

source: WooCommerce is not installed or activated. You'll need to install and activate WooCommerce to use LHV hire-purchase gateway.
et: WooCommerce ei ole paigaldatud või aktiveeritud. LHV järelmaksumooduli aktiveerimiseks on vaja WooCommerce paigaldada ja aktiveerida.

source: LHV hire-purchase gateway requires WooCommerce 3.0.0 or newer. Please update your WooCommerce installation and try again. Make sure you have a backup, though!
et: LHV järelmaksumoodul vajab WooCommerce versiooni 3.0.0 või uuemat. Palun uuenda oma WooCommerce'i pluginat ja proovi uuesti. Enne uuendust tee kindlasti lehest varukoopia!
